a
afternoon
airport
am
angry
animal
april
apple
are
art
ask
aunt
august
autumn
baby
bad
badminton
bag
ball
bank
bathroom
beach
bean
bear
beautiful
bed
bedroom
beef
bee
ben
bicycle
big
bird
biscuit
black
blackboard
blanket
blue
boat
book
bookmark
boy
bread
breakfast
bright
bring
bridge
brother
brown
burger
bus
busy
butter
butterfly
buy
by
cake
call
camera
camping
candy
car
carry
carrot
cartoon
catch
cat
chair
cheese
chess
chicken
child
children
chocolate
city
class
classmate
classroom
clean
clever
climb
clock
close
cloudy
clown
cold
collect
colourful
come
comic
computer
cook
cookie
corn
count
country
cousin
cow
crab
crayon
cute
cut
dark
dance
daughter
day
deer
december
desk
dictionary
did
diningroom
dinner
dirty
do
dog
doll
done
door
draw
drawing
drink
drum
duck
dumpling
easy
eat
egg
eight
eighteen
eighty
elephant
eleven
eraser
evening
exercise
excited
family
fast
fat
father
february
ferry
fifteen
fifty
file
find
fine
finish
fish
five
food
football
fork
forty
four
fourteen
friday
friend
frog
fruit
funny
game
garden
glue
go
goat
gone
good
grape
great
green
guitar
hamburger
happy
hard
harbour
he
heavy
hello
help
hill
hobby
home
horse
hospital
hot
hotel
house
hungry
i
icecream
insect
is
island
january
july
jump
june
juice
kick
kind
kitchen
knife
lamp
large
late
laugh
learn
library
lion
listen
little
livingroom
look
long
loud
lovely
lunch
make
man
map
march
market
may
meat
milk
minibus
monday
monkey
month
morning
mother
mouse
movie
museum
music
nice
night
nine
nineteen
ninety
notebook
november
noodle
noodles
october
office
old
one
open
orange
paint
panda
paper
park
parrot
pear
pen
pencil
pencilcase
people
person
pet
pharmacy
photo
picture
piano
pig
pineapple
pink
plate
play
playground
point
potato
postoffice
pretty
project
purple
put
question
queue
quick
quiet
rabbit
radio
railway
rainy
read
reader
reading
red
restaurant
rice
ride
road
robot
room
rug
ruler
run
sad
salad
salt
sandwich
saturday
sausage
say
school
scissors
sea
season
see
september
seven
seventeen
seventy
share
sharpener
she
sheep
shelf
shop
shoppingcentre
short
show
sing
singing
sister
sit
six
sixteen
sixty
skipping
sleep
slow
small
smile
snake
snack
sofa
son
soup
speak
spell
spider
spoon
sport
spring
stamp
stand
start
station
stop
story
street
strong
student
study
sugar
summer
sunday
sunny
supermarket
swim
sweet
table
take
talk
tall
taxi
teach
teacher
tea
television
tell
ten
tennis
textbook
them
they
thirteen
think
thirsty
thirty
this
three
throw
thursday
tiger
time
timetable
tired
today
toilet
to
tomato
tomorrow
touch
town
toy
train
tree
tuesday
tunnel
turtle
twelve
twenty
two
ugly
uncle
use
vegetable
village
violin
volleyball
wait
walk
wall
warm
was
washingmachine
watch
water
watermelon
weak
wear
weather
wednesday
week
went
were
wet
whale
white
window
windy
winter
woman
word
worksheet
write
writing
year
yellow
yesterday
young
zebra
zero
zoo